aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx66t/register_access/ccrx/iodefine.h
#define	IEN_BSC_BUSERR		IEN0
#define	IEN_RAM_RAMERR		IEN2
#define	IEN_FCU_FIFERR		IEN5
#define	IEN_FCU_FRDYI		IEN7
#define	IEN_ICU_SWINT2		IEN2
#define	IEN_ICU_SWINT		IEN3
#define	IEN_CMT0_CMI0		IEN4
#define	IEN_CMT1_CMI1		IEN5
#define	IEN_CMT2_CMI2		IEN6
#define	IEN_CMT3_CMI3		IEN7
#define	IEN_USB0_D0FIFO0	IEN2
#define	IEN_USB0_D1FIFO0	IEN3
#define	IEN_RSPI0_SPRI0		IEN6
#define	IEN_RSPI0_SPTI0		IEN7
#define	IEN_RIIC0_RXI0		IEN4
#define	IEN_RIIC0_TXI0		IEN5
#define	IEN_SCI1_RXI1		IEN4
#define	IEN_SCI1_TXI1		IEN5
#define	IEN_ICU_IRQ0		IEN0
#define	IEN_ICU_IRQ1		IEN1
#define	IEN_ICU_IRQ2		IEN2
#define	IEN_ICU_IRQ3		IEN3
#define	IEN_ICU_IRQ4		IEN4
#define	IEN_ICU_IRQ5		IEN5
#define	IEN_ICU_IRQ6		IEN6
#define	IEN_ICU_IRQ7		IEN7
#define	IEN_ICU_IRQ8		IEN0
#define	IEN_ICU_IRQ9		IEN1
#define	IEN_ICU_IRQ10		IEN2
#define	IEN_ICU_IRQ11		IEN3
#define	IEN_ICU_IRQ12		IEN4
#define	IEN_ICU_IRQ13		IEN5
#define	IEN_ICU_IRQ14		IEN6
#define	IEN_ICU_IRQ15		IEN7
#define	IEN_SCI5_RXI5		IEN4
#define	IEN_SCI5_TXI5		IEN5
#define	IEN_SCI6_RXI6		IEN6
#define	IEN_SCI6_TXI6		IEN7
#define	IEN_LVD1_LVD1		IEN0
#define	IEN_LVD2_LVD2		IEN1
#define	IEN_USB0_USBR0		IEN2
#define	IEN_IWDT_IWUNI		IEN7
#define	IEN_WDT_WUNI		IEN0
#define	IEN_SCI8_RXI8		IEN4
#define	IEN_SCI8_TXI8		IEN5
#define	IEN_SCI9_RXI9		IEN6
#define	IEN_SCI9_TXI9		IEN7
#define	IEN_ICU_GROUPBE0	IEN2
#define	IEN_ICU_GROUPBL0	IEN6
#define	IEN_ICU_GROUPBL1	IEN7
#define	IEN_ICU_GROUPAL0	IEN0
#define	IEN_SCI11_RXI11		IEN2
#define	IEN_SCI11_TXI11		IEN3
#define	IEN_SCI12_RXI12		IEN4
#define	IEN_SCI12_TXI12		IEN5
#define	IEN_DMAC_DMAC0I		IEN0
#define	IEN_DMAC_DMAC1I		IEN1
#define	IEN_DMAC_DMAC2I		IEN2
#define	IEN_DMAC_DMAC3I		IEN3
#define	IEN_DMAC_DMAC74I	IEN4
#define	IEN_OST_OSTDI		IEN5
#define	IEN_S12AD_S12ADI	IEN0
#define	IEN_S12AD_S12GBADI	IEN1
#define	IEN_S12AD_S12GCADI	IEN2
#define	IEN_S12AD1_S12ADI1	IEN4
#define	IEN_S12AD1_S12GBADI1	IEN5
#define	IEN_S12AD1_S12GCADI1	IEN6
#define	IEN_S12AD2_S12ADI2	IEN0
#define	IEN_S12AD2_S12GBADI2	IEN1
#define	IEN_S12AD2_S12GCADI2	IEN2
#define	IEN_TMR0_CMIA0		IEN2
#define	IEN_TMR0_CMIB0		IEN3
#define	IEN_TMR0_OVI0		IEN4
#define	IEN_TMR1_CMIA1		IEN5
#define	IEN_TMR1_CMIB1		IEN6
#define	IEN_TMR1_OVI1		IEN7
#define	IEN_TMR2_CMIA2		IEN0
#define	IEN_TMR2_CMIB2		IEN1
#define	IEN_TMR2_OVI2		IEN2
#define	IEN_TMR3_CMIA3		IEN3
#define	IEN_TMR3_CMIB3		IEN4
#define	IEN_TMR3_OVI3		IEN5
#define	IEN_TMR4_CMIA4		IEN6
#define	IEN_TMR4_CMIB4		IEN7
#define	IEN_TMR4_OVI4		IEN0
#define	IEN_TMR5_CMIA5		IEN1
#define	IEN_TMR5_CMIB5		IEN2
#define	IEN_TMR5_OVI5		IEN3
#define	IEN_TMR6_CMIA6		IEN4
#define	IEN_TMR6_CMIB6		IEN5
#define	IEN_TMR6_OVI6		IEN6
#define	IEN_TMR7_CMIA7		IEN7
#define	IEN_TMR7_CMIB7		IEN0
#define	IEN_TMR7_OVI7		IEN1
#define	IEN_CAN0_RXF0		IEN2
#define	IEN_CAN0_TXF0		IEN3
#define	IEN_CAN0_RXM0		IEN4
#define	IEN_CAN0_TXM0		IEN5
#define	IEN_USB0_USBI0		IEN6
#define	IEN_ELC_ELSR18I		IEN7
#define	IEN_ELC_ELSR19I		IEN0
#define	IEN_TSIP_RD			IEN1
#define	IEN_TSIP_WR			IEN2
#define	IEN_TSIP_ERR		IEN3
#define	IEN_CMPC0_CMPC0		IEN4
#define	IEN_CMPC1_CMPC1		IEN5
#define	IEN_CMPC2_CMPC2		IEN6
#define	IEN_CMPC3_CMPC3		IEN7
#define	IEN_CMPC4_CMPC4		IEN0
#define	IEN_CMPC5_CMPC5		IEN1
#define	IEN_PERIA_INTA208	IEN0
#define	IEN_PERIA_INTA209	IEN1
#define	IEN_PERIA_INTA210	IEN2
#define	IEN_PERIA_INTA211	IEN3
#define	IEN_PERIA_INTA212	IEN4
#define	IEN_PERIA_INTA213	IEN5
#define	IEN_PERIA_INTA214	IEN6
#define	IEN_PERIA_INTA215	IEN7
#define	IEN_PERIA_INTA216	IEN0
#define	IEN_PERIA_INTA217	IEN1
#define	IEN_PERIA_INTA218	IEN2
#define	IEN_PERIA_INTA219	IEN3
#define	IEN_PERIA_INTA220	IEN4
#define	IEN_PERIA_INTA221	IEN5
#define	IEN_PERIA_INTA222	IEN6
#define	IEN_PERIA_INTA223	IEN7
#define	IEN_PERIA_INTA224	IEN0
#define	IEN_PERIA_INTA225	IEN1
#define	IEN_PERIA_INTA226	IEN2
#define	IEN_PERIA_INTA227	IEN3
#define	IEN_PERIA_INTA228	IEN4
#define	IEN_PERIA_INTA229	IEN5
#define	IEN_PERIA_INTA230	IEN6
#define	IEN_PERIA_INTA231	IEN7
#define	IEN_PERIA_INTA232	IEN0
#define	IEN_PERIA_INTA233	IEN1
#define	IEN_PERIA_INTA234	IEN2
#define	IEN_PERIA_INTA235	IEN3
#define	IEN_PERIA_INTA236	IEN4
#define	IEN_PERIA_INTA237	IEN5
#define	IEN_PERIA_INTA238	IEN6
#define	IEN_PERIA_INTA239	IEN7
#define	IEN_PERIA_INTA240	IEN0
#define	IEN_PERIA_INTA241	IEN1
#define	IEN_PERIA_INTA242	IEN2
#define	IEN_PERIA_INTA243	IEN3
#define	IEN_PERIA_INTA244	IEN4
#define	IEN_PERIA_INTA245	IEN5
#define	IEN_PERIA_INTA246	IEN6
#define	IEN_PERIA_INTA247	IEN7
#define	IEN_PERIA_INTA248	IEN0
#define	IEN_PERIA_INTA249	IEN1
#define	IEN_PERIA_INTA250	IEN2
#define	IEN_PERIA_INTA251	IEN3
#define	IEN_PERIA_INTA252	IEN4
#define	IEN_PERIA_INTA253	IEN5
#define	IEN_PERIA_INTA254	IEN6
#define	IEN_PERIA_INTA255	IEN7
#define	VECT_BSC_BUSERR		16
#define	VECT_RAM_RAMERR		18
#define	VECT_FCU_FIFERR		21
#define	VECT_FCU_FRDYI		23
#define	VECT_ICU_SWINT2		26
#define	VECT_ICU_SWINT		27
#define	VECT_CMT0_CMI0		28
#define	VECT_CMT1_CMI1		29
#define	VECT_CMT2_CMI2		30
#define	VECT_CMT3_CMI3		31
#define	VECT_USB0_D0FIFO0	34
#define	VECT_USB0_D1FIFO0	35
#define	VECT_RSPI0_SPRI0	38
#define	VECT_RSPI0_SPTI0	39
#define	VECT_RIIC0_RXI0		52
#define	VECT_RIIC0_TXI0		53
#define	VECT_SCI1_RXI1		60
#define	VECT_SCI1_TXI1		61
#define	VECT_ICU_IRQ0		64
#define	VECT_ICU_IRQ1		65
#define	VECT_ICU_IRQ2		66
#define	VECT_ICU_IRQ3		67
#define	VECT_ICU_IRQ4		68
#define	VECT_ICU_IRQ5		69
#define	VECT_ICU_IRQ6		70
#define	VECT_ICU_IRQ7		71
#define	VECT_ICU_IRQ8		72
#define	VECT_ICU_IRQ9		73
#define	VECT_ICU_IRQ10		74
#define	VECT_ICU_IRQ11		75
#define	VECT_ICU_IRQ12		76
#define	VECT_ICU_IRQ13		77
#define	VECT_ICU_IRQ14		78
#define	VECT_ICU_IRQ15		79
#define	VECT_SCI5_RXI5		84
#define	VECT_SCI5_TXI5		85
#define	VECT_SCI6_RXI6		86
#define	VECT_SCI6_TXI6		87
#define	VECT_LVD1_LVD1		88
#define	VECT_LVD2_LVD2		89
#define	VECT_USB0_USBR0		90
#define	VECT_IWDT_IWUNI		95
#define	VECT_WDT_WUNI		96
#define	VECT_SCI8_RXI8		100
#define	VECT_SCI8_TXI8		101
#define	VECT_SCI9_RXI9		102
#define	VECT_SCI9_TXI9		103
#define	VECT_ICU_GROUPBE0	106
#define	VECT_ICU_GROUPBL0	110
#define	VECT_ICU_GROUPBL1	111
#define	VECT_ICU_GROUPAL0	112
#define	VECT_SCI11_RXI11	114
#define	VECT_SCI11_TXI11	115
#define	VECT_SCI12_RXI12	116
#define	VECT_SCI12_TXI12	117
#define	VECT_DMAC_DMAC0I	120
#define	VECT_DMAC_DMAC1I	121
#define	VECT_DMAC_DMAC2I	122
#define	VECT_DMAC_DMAC3I	123
#define	VECT_DMAC_DMAC74I	124
#define	VECT_OST_OSTDI		125
#define	VECT_S12AD_S12ADI	128
#define	VECT_S12AD_S12GBADI	129
#define	VECT_S12AD_S12GCADI	130
#define	VECT_S12AD1_S12ADI1	132
#define	VECT_S12AD1_S12GBADI1	133
#define	VECT_S12AD1_S12GCADI1	134
#define	VECT_S12AD2_S12ADI2	136
#define	VECT_S12AD2_S12GBADI2	137
#define	VECT_S12AD2_S12GCADI2	138
#define	VECT_TMR0_CMIA0		146
#define	VECT_TMR0_CMIB0		147
#define	VECT_TMR0_OVI0		148
#define	VECT_TMR1_CMIA1		149
#define	VECT_TMR1_CMIB1		150
#define	VECT_TMR1_OVI1		151
#define	VECT_TMR2_CMIA2		152
#define	VECT_TMR2_CMIB2		153
#define	VECT_TMR2_OVI2		154
#define	VECT_TMR3_CMIA3		155
#define	VECT_TMR3_CMIB3		156
#define	VECT_TMR3_OVI3		157
#define	VECT_TMR4_CMIA4		158
#define	VECT_TMR4_CMIB4		159
#define	VECT_TMR4_OVI4		160
#define	VECT_TMR5_CMIA5		161
#define	VECT_TMR5_CMIB5		162
#define	VECT_TMR5_OVI5		163
#define	VECT_TMR6_CMIA6		164
#define	VECT_TMR6_CMIB6		165
#define	VECT_TMR6_OVI6		166
#define	VECT_TMR7_CMIA7		167
#define	VECT_TMR7_CMIB7		168
#define	VECT_TMR7_OVI7		169
#define	VECT_CAN0_RXF0		170
#define	VECT_CAN0_TXF0		171
#define	VECT_CAN0_RXM0		172
#define	VECT_CAN0_TXM0		173
#define	VECT_USB0_USBI0		174
#define	VECT_ELC_ELSR18I	175
#define	VECT_ELC_ELSR19I	176
#define	VECT_TSIP_RD		177
#define	VECT_TSIP_WR		178
#define	VECT_TSIP_ERR		179
#define	VECT_CMPC0_CMPC0	180
#define	VECT_CMPC1_CMPC1	181
#define	VECT_CMPC2_CMPC2	182
#define	VECT_CMPC3_CMPC3	183
#define	VECT_CMPC4_CMPC4	184
#define	VECT_CMPC5_CMPC5	185
#define	VECT_PERIA_INTA208	208
#define	VECT_PERIA_INTA209	209
#define	VECT_PERIA_INTA210	210
#define	VECT_PERIA_INTA211	211
#define	VECT_PERIA_INTA212	212
#define	VECT_PERIA_INTA213	213
#define	VECT_PERIA_INTA214	214
#define	VECT_PERIA_INTA215	215
#define	VECT_PERIA_INTA216	216
#define	VECT_PERIA_INTA217	217
#define	VECT_PERIA_INTA218	218
#define	VECT_PERIA_INTA219	219
#define	VECT_PERIA_INTA220	220
#define	VECT_PERIA_INTA221	221
#define	VECT_PERIA_INTA222	222
#define	VECT_PERIA_INTA223	223
#define	VECT_PERIA_INTA224	224
#define	VECT_PERIA_INTA225	225
#define	VECT_PERIA_INTA226	226
#define	VECT_PERIA_INTA227	227
#define	VECT_PERIA_INTA228	228
#define	VECT_PERIA_INTA229	229
#define	VECT_PERIA_INTA230	230
#define	VECT_PERIA_INTA231	231
#define	VECT_PERIA_INTA232	232
#define	VECT_PERIA_INTA233	233
#define	VECT_PERIA_INTA234	234
#define	VECT_PERIA_INTA235	235
#define	VECT_PERIA_INTA236	236
#define	VECT_PERIA_INTA237	237
#define	VECT_PERIA_INTA238	238
#define	VECT_PERIA_INTA239	239
#define	VECT_PERIA_INTA240	240
#define	VECT_PERIA_INTA241	241
#define	VECT_PERIA_INTA242	242
#define	VECT_PERIA_INTA243	243
#define	VECT_PERIA_INTA244	244
#define	VECT_PERIA_INTA245	245
#define	VECT_PERIA_INTA246	246
#define	VECT_PERIA_INTA247	247
#define	VECT_PERIA_INTA248	248
#define	VECT_PERIA_INTA249	249
#define	VECT_PERIA_INTA250	250
#define	VECT_PERIA_INTA251	251
#define	VECT_PERIA_INTA252	252
#define	VECT_PERIA_INTA253	253
#define	VECT_PERIA_INTA254	254
#define	VECT_PERIA_INTA255	255
#define	MSTP_DMAC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC0	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC1	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC2	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC3	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC4	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC5	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC6	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC7	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DTC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_S12AD2	SYSTEM.MSTPCRA.BIT.MSTPA23
#define	MSTP_DA		SYSTEM.MSTPCRA.BIT.MSTPA19
#define	MSTP_S12AD	SYSTEM.MSTPCRA.BIT.MSTPA17
#define	MSTP_S12AD1	SYSTEM.MSTPCRA.BIT.MSTPA16
#define	MSTP_CMT0	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT1	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT2	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_CMT3	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_MTU	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU0	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU1	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU2	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU3	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU4	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU5	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU6	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU7	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU9	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_GPTW	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW0	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW1	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW2	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW3	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW4	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW5	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW6	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW7	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW8	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW9	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_HRPWM	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_POEG	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_TMR0	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR1	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR01	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR2	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR3	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR23	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR4	SYSTEM.MSTPCRA.BIT.MSTPA3
#define	MSTP_TMR5	SYSTEM.MSTPCRA.BIT.MSTPA3
#define	MSTP_TMR45	SYSTEM.MSTPCRA.BIT.MSTPA3
#define	MSTP_TMR6	SYSTEM.MSTPCRA.BIT.MSTPA2
#define	MSTP_TMR7	SYSTEM.MSTPCRA.BIT.MSTPA2
#define	MSTP_TMR67	SYSTEM.MSTPCRA.BIT.MSTPA2
#define	MSTP_SCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SMCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SMCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_SMCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_CRC	SYSTEM.MSTPCRB.BIT.MSTPB23
#define	MSTP_RIIC0	SYSTEM.MSTPCRB.BIT.MSTPB21
#define	MSTP_USB0	SYSTEM.MSTPCRB.BIT.MSTPB19
#define	MSTP_RSPI0	SYSTEM.MSTPCRB.BIT.MSTPB17
#define	MSTP_CMPC	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC0	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC1	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC2	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC3	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC4	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC5	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_ELC	SYSTEM.MSTPCRB.BIT.MSTPB9
#define	MSTP_DOC	SYSTEM.MSTPCRB.BIT.MSTPB6
#define	MSTP_SCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_SMCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_CAN0	SYSTEM.MSTPCRB.BIT.MSTPB0
#define	MSTP_SCI8	SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_SMCI8	SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_SCI9	SYSTEM.MSTPCRC.BIT.MSTPC26
#define	MSTP_SMCI9	SYSTEM.MSTPCRC.BIT.MSTPC26
#define	MSTP_SCI11	SYSTEM.MSTPCRC.BIT.MSTPC24
#define	MSTP_SMCI11	SYSTEM.MSTPCRC.BIT.MSTPC24
#define	MSTP_CAC	SYSTEM.MSTPCRC.BIT.MSTPC19
#define	MSTP_ECCRAM	SYSTEM.MSTPCRC.BIT.MSTPC6
#define	MSTP_RAM	SYSTEM.MSTPCRC.BIT.MSTPC0
#define	IS_CAN0_ERS0		IS0
#define	IS_SCI1_TEI1		IS2
#define	IS_SCI1_ERI1		IS3
#define	IS_SCI5_TEI5		IS10
#define	IS_SCI5_ERI5		IS11
#define	IS_SCI6_TEI6		IS12
#define	IS_SCI6_ERI6		IS13
#define	IS_SCI12_TEI12		IS16
#define	IS_SCI12_ERI12		IS17
#define	IS_SCI12_SCIX0		IS18
#define	IS_SCI12_SCIX1		IS19
#define	IS_SCI12_SCIX2		IS20
#define	IS_SCI12_SCIX3		IS21
#define	IS_CAC_FERRI		IS26
#define	IS_CAC_MENDI		IS27
#define	IS_CAC_OVFI			IS28
#define	IS_DOC_DOPCI		IS29
#define	IS_POEG_POEGGAI		IS0
#define	IS_POEG_POEGGBI		IS1
#define	IS_POEG_POEGGCI		IS2
#define	IS_POEG_POEGGDI		IS3
#define	IS_POE3_OEI5		IS8
#define	IS_POE3_OEI1		IS9
#define	IS_POE3_OEI2		IS10
#define	IS_POE3_OEI3		IS11
#define	IS_POE3_OEI4		IS12
#define	IS_RIIC0_TEI0		IS13
#define	IS_RIIC0_EEI0		IS14
#define	IS_S12AD2_S12CMPAI2	IS18
#define	IS_S12AD2_S12CMPBI2	IS19
#define	IS_S12AD_S12CMPAI	IS20
#define	IS_S12AD_S12CMPBI	IS21
#define	IS_S12AD1_S12CMPAI1	IS22
#define	IS_S12AD1_S12CMPBI1	IS23
#define	IS_SCI8_TEI8		IS24
#define	IS_SCI8_ERI8		IS25
#define	IS_SCI9_TEI9		IS26
#define	IS_SCI9_ERI9		IS27
#define	IS_SCI11_TEI11		IS12
#define	IS_SCI11_ERI11		IS13
#define	IS_RSPI0_SPII0		IS16
#define	IS_RSPI0_SPEI0		IS17
#define	EN_CAN0_ERS0		EN0
#define	EN_SCI1_TEI1		EN2
#define	EN_SCI1_ERI1		EN3
#define	EN_SCI5_TEI5		EN10
#define	EN_SCI5_ERI5		EN11
#define	EN_SCI6_TEI6		EN12
#define	EN_SCI6_ERI6		EN13
#define	EN_SCI12_TEI12		EN16
#define	EN_SCI12_ERI12		EN17
#define	EN_SCI12_SCIX0		EN18
#define	EN_SCI12_SCIX1		EN19
#define	EN_SCI12_SCIX2		EN20
#define	EN_SCI12_SCIX3		EN21
#define	EN_CAC_FERRI		EN26
#define	EN_CAC_MENDI		EN27
#define	EN_CAC_OVFI			EN28
#define	EN_DOC_DOPCI		EN29
#define	EN_POEG_POEGGAI		EN0
#define	EN_POEG_POEGGBI		EN1
#define	EN_POEG_POEGGCI		EN2
#define	EN_POEG_POEGGDI		EN3
#define	EN_POE3_OEI5		EN8
#define	EN_POE3_OEI1		EN9
#define	EN_POE3_OEI2		EN10
#define	EN_POE3_OEI3		EN11
#define	EN_POE3_OEI4		EN12
#define	EN_RIIC0_TEI0		EN13
#define	EN_RIIC0_EEI0		EN14
#define	EN_S12AD2_S12CMPAI2	EN18
#define	EN_S12AD2_S12CMPBI2	EN19
#define	EN_S12AD_S12CMPAI	EN20
#define	EN_S12AD_S12CMPBI	EN21
#define	EN_S12AD1_S12CMPAI1	EN22
#define	EN_S12AD1_S12CMPBI1	EN23
#define	EN_SCI8_TEI8		EN24
#define	EN_SCI8_ERI8		EN25
#define	EN_SCI9_TEI9		EN26
#define	EN_SCI9_ERI9		EN27
#define	EN_SCI11_TEI11		EN12
#define	EN_SCI11_ERI11		EN13
#define	EN_RSPI0_SPII0		EN16
#define	EN_RSPI0_SPEI0		EN17
#define	CLR_CAN0_ERS0		CLR0
#define	GEN_CAN0_ERS0			GENBE0
#define	GEN_SCI1_TEI1			GENBL0
#define	GEN_SCI1_ERI1			GENBL0
#define	GEN_SCI5_TEI5			GENBL0
#define	GEN_SCI5_ERI5			GENBL0
#define	GEN_SCI6_TEI6			GENBL0
#define	GEN_SCI6_ERI6			GENBL0
#define	GEN_SCI12_TEI12			GENBL0
#define	GEN_SCI12_ERI12			GENBL0
#define	GEN_SCI12_SCIX0			GENBL0
#define	GEN_SCI12_SCIX1			GENBL0
#define	GEN_SCI12_SCIX2			GENBL0
#define	GEN_SCI12_SCIX3			GENBL0
#define	GEN_CAC_FERRI			GENBL0
#define	GEN_CAC_MENDI			GENBL0
#define	GEN_CAC_OVFI			GENBL0
#define	GEN_DOC_DOPCI			GENBL0
#define	GEN_POEG_POEGGAI		GENBL1
#define	GEN_POEG_POEGGBI		GENBL1
#define	GEN_POEG_POEGGCI		GENBL1
#define	GEN_POEG_POEGGDI		GENBL1
#define	GEN_POE3_OEI5			GENBL1
#define	GEN_POE3_OEI1			GENBL1
#define	GEN_POE3_OEI2			GENBL1
#define	GEN_POE3_OEI3			GENBL1
#define	GEN_POE3_OEI4			GENBL1
#define	GEN_RIIC0_TEI0			GENBL1
#define	GEN_RIIC0_EEI0			GENBL1
#define	GEN_S12AD2_S12CMPAI2	GENBL1
#define	GEN_S12AD2_S12CMPBI2	GENBL1
#define	GEN_S12AD_S12CMPAI		GENBL1
#define	GEN_S12AD_S12CMPBI		GENBL1
#define	GEN_S12AD1_S12CMPAI1	GENBL1
#define	GEN_S12AD1_S12CMPBI1	GENBL1
#define	GEN_SCI8_TEI8			GENBL1
#define	GEN_SCI8_ERI8			GENBL1
#define	GEN_SCI9_TEI9			GENBL1
#define	GEN_SCI9_ERI9			GENBL1
#define	GEN_SCI11_TEI11			GENAL0
#define	GEN_SCI11_ERI11			GENAL0
#define	GEN_RSPI0_SPII0			GENAL0
#define	GEN_RSPI0_SPEI0			GENAL0
#define	GRP_CAN0_ERS0			GRPBE0
#define	GRP_SCI1_TEI1			GRPBL0
#define	GRP_SCI1_ERI1			GRPBL0
#define	GRP_SCI5_TEI5			GRPBL0
#define	GRP_SCI5_ERI5			GRPBL0
#define	GRP_SCI6_TEI6			GRPBL0
#define	GRP_SCI6_ERI6			GRPBL0
#define	GRP_SCI12_TEI12			GRPBL0
#define	GRP_SCI12_ERI12			GRPBL0
#define	GRP_SCI12_SCIX0			GRPBL0
#define	GRP_SCI12_SCIX1			GRPBL0
#define	GRP_SCI12_SCIX2			GRPBL0
#define	GRP_SCI12_SCIX3			GRPBL0
#define	GRP_CAC_FERRI			GRPBL0
#define	GRP_CAC_MENDI			GRPBL0
#define	GRP_CAC_OVFI			GRPBL0
#define	GRP_DOC_DOPCI			GRPBL0
#define	GRP_POEG_POEGGAI		GRPBL1
#define	GRP_POEG_POEGGBI		GRPBL1
#define	GRP_POEG_POEGGCI		GRPBL1
#define	GRP_POEG_POEGGDI		GRPBL1
#define	GRP_POE3_OEI5			GRPBL1
#define	GRP_POE3_OEI1			GRPBL1
#define	GRP_POE3_OEI2			GRPBL1
#define	GRP_POE3_OEI3			GRPBL1
#define	GRP_POE3_OEI4			GRPBL1
#define	GRP_RIIC0_TEI0			GRPBL1
#define	GRP_RIIC0_EEI0			GRPBL1
#define	GRP_S12AD2_S12CMPAI2	GRPBL1
#define	GRP_S12AD2_S12CMPBI2	GRPBL1
#define	GRP_S12AD_S12CMPAI		GRPBL1
#define	GRP_S12AD_S12CMPBI		GRPBL1
#define	GRP_S12AD1_S12CMPAI1	GRPBL1
#define	GRP_S12AD1_S12CMPBI1	GRPBL1
#define	GRP_SCI8_TEI8			GRPBL1
#define	GRP_SCI8_ERI8			GRPBL1
#define	GRP_SCI9_TEI9			GRPBL1
#define	GRP_SCI9_ERI9			GRPBL1
#define	GRP_SCI11_TEI11			GRPAL0
#define	GRP_SCI11_ERI11			GRPAL0
#define	GRP_RSPI0_SPII0			GRPAL0
#define	GRP_RSPI0_SPEI0			GRPAL0
#define	GCR_CAN0_ERS0			GCRBE0
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )
#define	__IS( x )		ICU.GRP ## x.BIT.IS ## x
#define	 _IS( x )		__IS( x )
#define	  IS( x , y )	_IS( _ ## x ## _ ## y )
#define	__EN( x )		ICU.GEN ## x.BIT.EN ## x
#define	 _EN( x )		__EN( x )
#define	  EN( x , y )	_EN( _ ## x ## _ ## y )
#define	__CLR( x )		ICU.GCR ## x.BIT.CLR ## x
#define	 _CLR( x )		__CLR( x )
#define	  CLR( x , y )	_CLR( _ ## x ## _ ## y )
#define	BSC		(*(volatile struct st_bsc    __evenaccess *)0x81300)
#define	CAC		(*(volatile struct st_cac    __evenaccess *)0x8B000)
#define	CAN0	(*(volatile struct st_can    __evenaccess *)0x90200)
#define	CMPC0	(*(volatile struct st_cmpc   __evenaccess *)0xA0C80)
#define	CMPC1	(*(volatile struct st_cmpc   __evenaccess *)0xA0CA0)
#define	CMPC2	(*(volatile struct st_cmpc   __evenaccess *)0xA0CC0)
#define	CMPC3	(*(volatile struct st_cmpc   __evenaccess *)0xA0CE0)
#define	CMPC4	(*(volatile struct st_cmpc   __evenaccess *)0xA0D00)
#define	CMPC5	(*(volatile struct st_cmpc   __evenaccess *)0xA0D20)
#define	CMT		(*(volatile struct st_cmt    __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0   __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0   __evenaccess *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0   __evenaccess *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0   __evenaccess *)0x88018)
#define	CRC		(*(volatile struct st_crc    __evenaccess *)0x88280)
#define	DA		(*(volatile struct st_da     __evenaccess *)0x88040)
#define	DMAC	(*(volatile struct st_dmac   __evenaccess *)0x82200)
#define	DMAC0	(*(volatile struct st_dmac0  __evenaccess *)0x82000)
#define	DMAC1	(*(volatile struct st_dmac1  __evenaccess *)0x82040)
#define	DMAC2	(*(volatile struct st_dmac1  __evenaccess *)0x82080)
#define	DMAC3	(*(volatile struct st_dmac1  __evenaccess *)0x820C0)
#define	DMAC4	(*(volatile struct st_dmac1  __evenaccess *)0x82100)
#define	DMAC5	(*(volatile struct st_dmac1  __evenaccess *)0x82140)
#define	DMAC6	(*(volatile struct st_dmac1  __evenaccess *)0x82180)
#define	DMAC7	(*(volatile struct st_dmac1  __evenaccess *)0x821C0)
#define	DOC		(*(volatile struct st_doc    __evenaccess *)0x8B080)
#define	DTC		(*(volatile struct st_dtc    __evenaccess *)0x82400)
#define	ELC		(*(volatile struct st_elc    __evenaccess *)0x8B100)
#define	FLASH	(*(volatile struct st_flash  __evenaccess *)0x81000)
#define	GPTW0	(*(volatile struct st_gptw   __evenaccess *)0xC2000)
#define	GPTW1	(*(volatile struct st_gptw   __evenaccess *)0xC2100)
#define	GPTW2	(*(volatile struct st_gptw   __evenaccess *)0xC2200)
#define	GPTW3	(*(volatile struct st_gptw   __evenaccess *)0xC2300)
#define	GPTW4	(*(volatile struct st_gptw   __evenaccess *)0xC2400)
#define	GPTW5	(*(volatile struct st_gptw   __evenaccess *)0xC2500)
#define	GPTW6	(*(volatile struct st_gptw   __evenaccess *)0xC2600)
#define	GPTW7	(*(volatile struct st_gptw   __evenaccess *)0xC2700)
#define	GPTW8	(*(volatile struct st_gptw   __evenaccess *)0xC2800)
#define	GPTW9	(*(volatile struct st_gptw   __evenaccess *)0xC2900)
#define	HRPWM	(*(volatile struct st_hrpwm  __evenaccess *)0xC2A00)
#define	ICU		(*(volatile struct st_icu    __evenaccess *)0x87000)
#define	IWDT	(*(volatile struct st_iwdt   __evenaccess *)0x88030)
#define	MPC		(*(volatile struct st_mpc    __evenaccess *)0x8C100)
#define	MPU		(*(volatile struct st_mpu    __evenaccess *)0x86400)
#define	MTU		(*(volatile struct st_mtu    __evenaccess *)0xC120A)
#define	MTU0	(*(volatile struct st_mtu0   __evenaccess *)0xC1290)
#define	MTU1	(*(volatile struct st_mtu1   __evenaccess *)0xC1290)
#define	MTU2	(*(volatile struct st_mtu2   __evenaccess *)0xC1292)
#define	MTU3	(*(volatile struct st_mtu3   __evenaccess *)0xC1200)
#define	MTU4	(*(volatile struct st_mtu4   __evenaccess *)0xC1200)
#define	MTU5	(*(volatile struct st_mtu5   __evenaccess *)0xC1A94)
#define	MTU6	(*(volatile struct st_mtu6   __evenaccess *)0xC1A00)
#define	MTU7	(*(volatile struct st_mtu7   __evenaccess *)0xC1A00)
#define	MTU9	(*(volatile struct st_mtu9   __evenaccess *)0xC1296)
#define	OFSM	(*(volatile struct st_ofsm   __evenaccess *)0x120040)
#define	POE		(*(volatile struct st_poe    __evenaccess *)0x9E400)
#define	POEG	(*(volatile struct st_poeg   __evenaccess *)0x9E000)
#define	PORT0	(*(volatile struct st_port0  __evenaccess *)0x8C000)
#define	PORT1	(*(volatile struct st_port1  __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2  __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3  __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4  __evenaccess *)0x8C004)
#define	PORT5	(*(volatile struct st_port5  __evenaccess *)0x8C005)
#define	PORT6	(*(volatile struct st_port6  __evenaccess *)0x8C006)
#define	PORT7	(*(volatile struct st_port7  __evenaccess *)0x8C007)
#define	PORT8	(*(volatile struct st_port8  __evenaccess *)0x8C008)
#define	PORT9	(*(volatile struct st_port9  __evenaccess *)0x8C009)
#define	PORTA	(*(volatile struct st_porta  __evenaccess *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb  __evenaccess *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc  __evenaccess *)0x8C00C)
