aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx66t/register_access/ccrx/iodefine.h
typedef struct st_ofsm {
	union {
		unsigned long LONG;
		struct {
			unsigned long RDPR:1;
			unsigned long WRPR:1;
			unsigned long SEPR:1;
			unsigned long :1;
			unsigned long SPE:1;
			unsigned long :2;
			unsigned long IDE:1;
			unsigned long :24;
		} BIT;
	} SPCC;
	char           wk0[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long TMEF:3;
			unsigned long :24;
		} BIT;
	} TMEF;
	char           wk1[4];
	union {
		unsigned char BYTE;
		struct {
			unsigned long ID4:8;
			unsigned long ID3:8;
			unsigned long ID2:8;
			unsigned long ID1:8;
			unsigned long ID8:8;
			unsigned long ID7:8;
			unsigned long ID6:8;
			unsigned long ID5:8;
			unsigned long ID12:8;
			unsigned long ID11:8;
			unsigned long ID10:8;
			unsigned long ID9:8;
			unsigned long ID16:8;
			unsigned long ID15:8;
			unsigned long ID14:8;
			unsigned long ID13:8;
		} BIT;
	} OSIS;
	unsigned long  TMINF;
	union {
		unsigned long LONG;
		struct {
			unsigned long :29;
			unsigned long MDE:3;
		} BIT;
	} MDE;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long WDTRSTIRQS:1;
			unsigned long WDTRPSS:2;
			unsigned long WDTRPES:2;
			unsigned long WDTCKS:4;
			unsigned long WDTTOPS:2;
			unsigned long WDTSTRT:1;
			unsigned long :2;
			unsigned long IWDTSLCSTP:1;
			unsigned long :1;
			unsigned long IWDTRSTIRQS:1;
			unsigned long IWDTRPSS:2;
			unsigned long IWDTRPES:2;
			unsigned long IWDTCKS:4;
			unsigned long IWDTTOPS:2;
			unsigned long IWDTSTRT:1;
			unsigned long :1;
		} BIT;
	} OFS0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :23;
			unsigned long HOCOEN:1;
			unsigned long :5;
			unsigned long LVDAS:1;
			unsigned long VDSEL:2;
		} BIT;
	} OFS1;
	char           wk2[12];
	union {
		unsigned long LONG;
		struct {
			unsigned long CODE:32;
		} BIT;
	} ROMCODE;
} st_ofsm_t;

typedef struct st_poe {
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short POE0F:1;
			unsigned short :3;
			unsigned short PIE1:1;
			unsigned short POE0M2:4;
			unsigned short POE0M:4;
		} BIT;
	} ICSR1;
	union {
		unsigned short WORD;
		struct {
			unsigned short OSF1:1;
			unsigned short :5;
			unsigned short OCE1:1;
			unsigned short OIE1:1;
			unsigned short :8;
		} BIT;
	} OCSR1;
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short POE4F:1;
			unsigned short :3;
			unsigned short PIE2:1;
			unsigned short POE4M2:4;
			unsigned short POE4M:4;
		} BIT;
	} ICSR2;
	union {
		unsigned short WORD;
		struct {
			unsigned short OSF2:1;
			unsigned short :5;
			unsigned short OCE2:1;
			unsigned short OIE2:1;
			unsigned short :8;
		} BIT;
	} OCSR2;
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short POE8F:1;
			unsigned short :2;
			unsigned short POE8E:1;
			unsigned short PIE3:1;
			unsigned short POE8M2:4;
			unsigned short POE8M:4;
		} BIT;
	} ICSR3;
	char           wk0[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :4;
			unsigned char MTU0DZE:1;
			unsigned char MTU0CZE:1;
			unsigned char MTU0BZE:1;
			unsigned char MTU0AZE:1;
		} BIT;
	} POECR1;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short MTU3BDZE:1;
			unsigned short MTU4ACZE:1;
			unsigned short MTU4BDZE:1;
			unsigned short :5;
			unsigned short MTU6BDZE:1;
			unsigned short MTU7ACZE:1;
			unsigned short MTU7BDZE:1;
		} BIT;
	} POECR2;
	union {
		unsigned short WORD;
		struct {
			unsigned short :6;
			unsigned short GPT9ABZE:1;
			unsigned short GPT8ABZE:1;
			unsigned short GPT7ABZE:1;
			unsigned short GPT6ABZE:1;
			unsigned short GPT5ABZE:1;
			unsigned short GPT4ABZE:1;
			unsigned short GPT3ABZE:1;
			unsigned short GPT2ABZE:1;
			unsigned short GPT1ABZE:1;
			unsigned short GPT0ABZE:1;
		} BIT;
	} POECR3;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short IC10ADDMT34ZE:1;
			unsigned short IC9ADDMT34ZE:1;
			unsigned short IC8ADDMT34ZE:1;
			unsigned short :1;
			unsigned short IC6ADDMT34ZE:1;
			unsigned short IC5ADDMT34ZE:1;
			unsigned short IC4ADDMT34ZE:1;
			unsigned short IC3ADDMT34ZE:1;
			unsigned short IC2ADDMT34ZE:1;
			unsigned short IC1ADDMT34ZE:1;
			unsigned short CMADDMT34ZE:1;
		} BIT;
	} POECR4;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short IC10ADDMT0ZE:1;
			unsigned short IC9ADDMT0ZE:1;
			unsigned short IC8ADDMT0ZE:1;
			unsigned short :1;
			unsigned short IC6ADDMT0ZE:1;
			unsigned short IC5ADDMT0ZE:1;
			unsigned short IC4ADDMT0ZE:1;
			unsigned short IC3ADDMT0ZE:1;
			unsigned short IC2ADDMT0ZE:1;
			unsigned short IC1ADDMT0ZE:1;
			unsigned short CMADDMT0ZE:1;
		} BIT;
	} POECR5;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short IC10ADDGPT01ZE:1;
			unsigned short IC9ADDGPT01ZE:1;
			unsigned short IC8ADDGPT01ZE:1;
			unsigned short :1;
			unsigned short IC6ADDGPT01ZE:1;
			unsigned short IC5ADDGPT01ZE:1;
			unsigned short IC4ADDGPT01ZE:1;
			unsigned short IC3ADDGPT01ZE:1;
			unsigned short IC2ADDGPT01ZE:1;
			unsigned short IC1ADDGPT01ZE:1;
			unsigned short CMADDGPT01ZE:1;
		} BIT;
	} POECR6;
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short POE10F:1;
			unsigned short :2;
			unsigned short POE10E:1;
			unsigned short PIE4:1;
			unsigned short POE10M2:4;
			unsigned short POE10M:4;
		} BIT;
	} ICSR4;
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short POE11F:1;
			unsigned short :2;
			unsigned short POE11E:1;
			unsigned short PIE5:1;
			unsigned short POE11M2:4;
			unsigned short POE11M:4;
		} BIT;
	} ICSR5;
	union {
		unsigned short WORD;
		struct {
			unsigned short :8;
			unsigned short OLSEN:1;
			unsigned short :1;
			unsigned short OLSG2B:1;
			unsigned short OLSG2A:1;
			unsigned short OLSG1B:1;
			unsigned short OLSG1A:1;
			unsigned short OLSG0B:1;
			unsigned short OLSG0A:1;
		} BIT;
	} ALR1;
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short OSTSTF:1;
			unsigned short :2;
			unsigned short OSTSTE:1;
			unsigned short :9;
		} BIT;
	} ICSR6;
	union {
		unsigned short WORD;
		struct {
			unsigned short :8;
			unsigned short OLSEN:1;
			unsigned short :1;
			unsigned short OLSG6B:1;
			unsigned short OLSG6A:1;
			unsigned short OLSG5B:1;
			unsigned short OLSG5A:1;
			unsigned short OLSG4B:1;
			unsigned short OLSG4A:1;
		} BIT;
	} ALR2;
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short POE12F:1;
			unsigned short :2;
			unsigned short POE12E:1;
			unsigned short PIE7:1;
			unsigned short POE12M2:4;
			unsigned short POE12M:4;
		} BIT;
	} ICSR7;
	union {
		unsigned short WORD;
		struct {
			unsigned short :12;
			unsigned short MTU9DZE:1;
			unsigned short MTU9CZE:1;
			unsigned short MTU9BZE:1;
			unsigned short MTU9AZE:1;
		} BIT;
	} POECR7;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short IC10ADDMT9ZE:1;
			unsigned short IC9ADDMT9ZE:1;
			unsigned short IC8ADDMT9ZE:1;
			unsigned short :1;
			unsigned short IC6ADDMT9ZE:1;
			unsigned short IC5ADDMT9ZE:1;
			unsigned short IC4ADDMT9ZE:1;
			unsigned short IC3ADDMT9ZE:1;
			unsigned short IC2ADDMT9ZE:1;
			unsigned short IC1ADDMT9ZE:1;
			unsigned short CMADDMT9ZE:1;
		} BIT;
	} POECR8;
	union {
		unsigned short WORD;
		struct {
			unsigned short :10;
			unsigned short C5FLAG:1;
			unsigned short C4FLAG:1;
			unsigned short C3FLAG:1;
			unsigned short C2FLAG:1;
			unsigned short C1FLAG:1;
			unsigned short C0FLAG:1;
		} BIT;
	} POECMPFR;
	union {
		unsigned short WORD;
		struct {
			unsigned short :10;
			unsigned short POEREQ5:1;
			unsigned short POEREQ4:1;
			unsigned short POEREQ3:1;
			unsigned short POEREQ2:1;
			unsigned short POEREQ1:1;
			unsigned short POEREQ0:1;
		} BIT;
	} POECMPSEL;
	union {
		unsigned short WORD;
		struct {
			unsigned short OSF3:1;
			unsigned short :5;
			unsigned short OCE3:1;
			unsigned short OIE3:1;
			unsigned short :8;
		} BIT;
	} OCSR3;
	union {
		unsigned short WORD;
		struct {
			unsigned short :8;
			unsigned short OLSEN:1;
			unsigned short :1;
			unsigned short OLSG2B:1;
			unsigned short OLSG2A:1;
			unsigned short OLSG1B:1;
			unsigned short OLSG1A:1;
			unsigned short OLSG0B:1;
			unsigned short OLSG0A:1;
		} BIT;
	} ALR3;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short GPT79HIZ:1;
			unsigned short GPT46HIZ:1;
			unsigned short GPT02HIZ:1;
			unsigned short :1;
			unsigned short MTUCH9HIZ:1;
			unsigned short :1;
			unsigned short GPT23HIZ:1;
			unsigned short GPT01HIZ:1;
			unsigned short MTUCH0HIZ:1;
			unsigned short MTUCH67HIZ:1;
			unsigned short MTUCH34HIZ:1;
		} BIT;
	} SPOER;
	union {
		unsigned short WORD;
		struct {
			unsigned short :4;
			unsigned short MTU9DME:1;
			unsigned short MTU9CME:1;
			unsigned short MTU9BME:1;
			unsigned short MTU9AME:1;
			unsigned short :4;
			unsigned short MTU0DME:1;
			unsigned short MTU0CME:1;
			unsigned short MTU0BME:1;
			unsigned short MTU0AME:1;
		} BIT;
	} PMMCR0;
	union {
		unsigned short WORD;
		struct {
			unsigned short :2;
			unsigned short MTU3DME:1;
			unsigned short MTU4CME:1;
			unsigned short MTU4DME:1;
			unsigned short MTU3BME:1;
			unsigned short MTU4AME:1;
			unsigned short MTU4BME:1;
			unsigned short :2;
			unsigned short MTU6DME:1;
			unsigned short MTU7CME:1;
			unsigned short MTU7DME:1;
			unsigned short MTU6BME:1;
			unsigned short MTU7AME:1;
			unsigned short MTU7BME:1;
		} BIT;
	} PMMCR1;
	union {
		unsigned short WORD;
		struct {
			unsigned short GPT7BME:1;
			unsigned short GPT7AME:1;
			unsigned short GPT6BME:1;
			unsigned short GPT6AME:1;
			unsigned short GPT5BME:1;
			unsigned short GPT5AME:1;
			unsigned short GPT4BME:1;
			unsigned short GPT4AME:1;
			unsigned short GPT3BME:1;
			unsigned short GPT3AME:1;
			unsigned short GPT2BME:1;
			unsigned short GPT2AME:1;
			unsigned short GPT1BME:1;
			unsigned short GPT1AME:1;
			unsigned short GPT0BME:1;
			unsigned short GPT0AME:1;
		} BIT;
	} PMMCR2;
	union {
		unsigned short WORD;
		struct {
			unsigned short :12;
			unsigned short GPT9BME:1;
			unsigned short GPT9AME:1;
			unsigned short GPT8BME:1;
			unsigned short GPT8AME:1;
		} BIT;
	} PMMCR3;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char POEREQ5:1;
			unsigned char POEREQ4:1;
			unsigned char POEREQ3:1;
			unsigned char POEREQ2:1;
			unsigned char POEREQ1:1;
			unsigned char POEREQ0:1;
		} BIT;
	} POECMPEX0;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char POEREQ5:1;
			unsigned char POEREQ4:1;
			unsigned char POEREQ3:1;
			unsigned char POEREQ2:1;
			unsigned char POEREQ1:1;
			unsigned char POEREQ0:1;
		} BIT;
	} POECMPEX1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char POEREQ5:1;
			unsigned char POEREQ4:1;
			unsigned char POEREQ3:1;
			unsigned char POEREQ2:1;
			unsigned char POEREQ1:1;
			unsigned char POEREQ0:1;
		} BIT;
	} POECMPEX2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char POEREQ5:1;
			unsigned char POEREQ4:1;
			unsigned char POEREQ3:1;
			unsigned char POEREQ2:1;
			unsigned char POEREQ1:1;
			unsigned char POEREQ0:1;
		} BIT;
	} POECMPEX3;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char POEREQ5:1;
			unsigned char POEREQ4:1;
			unsigned char POEREQ3:1;
			unsigned char POEREQ2:1;
			unsigned char POEREQ1:1;
			unsigned char POEREQ0:1;
		} BIT;
	} POECMPEX4;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char POEREQ5:1;
			unsigned char POEREQ4:1;
			unsigned char POEREQ3:1;
			unsigned char POEREQ2:1;
			unsigned char POEREQ1:1;
			unsigned char POEREQ0:1;
		} BIT;
	} POECMPEX5;
	char           wk1[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short POE9F:1;
			unsigned short :2;
			unsigned short POE9E:1;
			unsigned short PIE8:1;
			unsigned short POE9M2:4;
			unsigned short POE9M:4;
		} BIT;
	} ICSR8;
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short POE13F:1;
			unsigned short :2;
			unsigned short POE13E:1;
			unsigned short PIE9:1;
			unsigned short POE13M2:4;
			unsigned short POE13M:4;
		} BIT;
	} ICSR9;
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short POE14F:1;
			unsigned short :2;
			unsigned short POE14E:1;
			unsigned short PIE10:1;
			unsigned short POE14M2:4;
			unsigned short POE14M:4;
		} BIT;
	} ICSR10;
	union {
		unsigned short WORD;
		struct {
			unsigned short OSF4:1;
			unsigned short :5;
			unsigned short OCE4:1;
			unsigned short OIE4:1;
			unsigned short :8;
		} BIT;
	} OCSR4;
	union {
		unsigned short WORD;
		struct {
			unsigned short OSF5:1;
			unsigned short :5;
			unsigned short OCE5:1;
			unsigned short OIE5:1;
			unsigned short :8;
		} BIT;
	} OCSR5;
	union {
		unsigned short WORD;
		struct {
			unsigned short :8;
			unsigned short OLSEN:1;
			unsigned short :1;
			unsigned short OLSG2B:1;
			unsigned short OLSG2A:1;
			unsigned short OLSG1B:1;
			unsigned short OLSG1A:1;
			unsigned short OLSG0B:1;
			unsigned short OLSG0A:1;
		} BIT;
	} ALR4;
	union {
		unsigned short WORD;
		struct {
			unsigned short :8;
			unsigned short OLSEN:1;
			unsigned short :1;
			unsigned short OLSG2B:1;
			unsigned short OLSG2A:1;
			unsigned short OLSG1B:1;
			unsigned short OLSG1A:1;
			unsigned short OLSG0B:1;
			unsigned short OLSG0A:1;
		} BIT;
	} ALR5;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short IC10ADDMT67ZE:1;
			unsigned short IC9ADDMT67ZE:1;
			unsigned short IC8ADDMT67ZE:1;
			unsigned short :1;
			unsigned short IC6ADDMT67ZE:1;
			unsigned short IC5ADDMT67ZE:1;
			unsigned short IC4ADDMT67ZE:1;
			unsigned short IC3ADDMT67ZE:1;
			unsigned short IC2ADDMT67ZE:1;
			unsigned short IC1ADDMT67ZE:1;
			unsigned short CMADDMT67ZE:1;
		} BIT;
	} POECR4B;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short IC10ADDGPT23ZE:1;
			unsigned short IC9ADDGPT23ZE:1;
			unsigned short IC8ADDGPT23ZE:1;
			unsigned short :1;
			unsigned short IC6ADDGPT23ZE:1;
			unsigned short IC5ADDGPT23ZE:1;
			unsigned short IC4ADDGPT23ZE:1;
			unsigned short IC3ADDGPT23ZE:1;
			unsigned short IC2ADDGPT23ZE:1;
			unsigned short IC1ADDGPT23ZE:1;
			unsigned short CMADDGPT23ZE:1;
		} BIT;
	} POECR6B;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short IC10ADDGPT02ZE:1;
			unsigned short IC9ADDGPT02ZE:1;
			unsigned short IC8ADDGPT02ZE:1;
			unsigned short :1;
			unsigned short IC6ADDGPT02ZE:1;
			unsigned short IC5ADDGPT02ZE:1;
			unsigned short IC4ADDGPT02ZE:1;
			unsigned short IC3ADDGPT02ZE:1;
			unsigned short IC2ADDGPT02ZE:1;
			unsigned short IC1ADDGPT02ZE:1;
			unsigned short CMADDGPT02ZE:1;
		} BIT;
	} POECR9;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short IC10ADDGPT46ZE:1;
			unsigned short IC9ADDGPT46ZE:1;
			unsigned short IC8ADDGPT46ZE:1;
			unsigned short :1;
			unsigned short IC6ADDGPT46ZE:1;
			unsigned short IC5ADDGPT46ZE:1;
			unsigned short IC4ADDGPT46ZE:1;
			unsigned short IC3ADDGPT46ZE:1;
			unsigned short IC2ADDGPT46ZE:1;
			unsigned short IC1ADDGPT46ZE:1;
			unsigned short CMADDGPT46ZE:1;
		} BIT;
	} POECR10;
	union {
		unsigned short WORD;
		struct {
			unsigned short :5;
			unsigned short IC10ADDGPT79ZE:1;
			unsigned short IC9ADDGPT79ZE:1;
			unsigned short IC8ADDGPT79ZE:1;
			unsigned short :1;
			unsigned short IC6ADDGPT79ZE:1;
			unsigned short IC5ADDGPT79ZE:1;
			unsigned short IC4ADDGPT79ZE:1;
			unsigned short IC3ADDGPT79ZE:1;
			unsigned short IC2ADDGPT79ZE:1;
			unsigned short IC1ADDGPT79ZE:1;
			unsigned short CMADDGPT79ZE:1;
		} BIT;
	} POECR11;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char POEREQ5:1;
			unsigned char POEREQ4:1;
			unsigned char POEREQ3:1;
			unsigned char POEREQ2:1;
			unsigned char POEREQ1:1;
			unsigned char POEREQ0:1;
		} BIT;
	} POECMPEX6;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char POEREQ5:1;
			unsigned char POEREQ4:1;
			unsigned char POEREQ3:1;
			unsigned char POEREQ2:1;
			unsigned char POEREQ1:1;
			unsigned char POEREQ0:1;
		} BIT;
	} POECMPEX7;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char POEREQ5:1;
			unsigned char POEREQ4:1;
			unsigned char POEREQ3:1;
			unsigned char POEREQ2:1;
			unsigned char POEREQ1:1;
			unsigned char POEREQ0:1;
		} BIT;
	} POECMPEX8;
	char           wk2[5];
	union {
		unsigned char BYTE;
		struct {
			unsigned char M0BSEL:4;
			unsigned char M0ASEL:4;
		} BIT;
	} M0SELR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char M0DSEL:4;
			unsigned char M0CSEL:4;
		} BIT;
	} M0SELR2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char M3DSEL:4;
			unsigned char M3BSEL:4;
		} BIT;
	} M3SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char M4CSEL:4;
			unsigned char M4ASEL:4;
		} BIT;
	} M4SELR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char M4DSEL:4;
			unsigned char M4BSEL:4;
		} BIT;
	} M4SELR2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char M6DSEL:4;
			unsigned char M6BSEL:4;
		} BIT;
	} M6SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char M7CSEL:4;
			unsigned char M7ASEL:4;
		} BIT;
	} M7SELR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char M7DSEL:4;
			unsigned char M7BSEL:4;
		} BIT;
	} M7SELR2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char M9BSEL:4;
			unsigned char M9ASEL:4;
		} BIT;
	} M9SELR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char M9DSEL:4;
			unsigned char M9CSEL:4;
		} BIT;
	} M9SELR2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char G0BSEL:4;
			unsigned char G0ASEL:4;
		} BIT;
	} G0SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char G1BSEL:4;
			unsigned char G1ASEL:4;
		} BIT;
	} G1SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char G2BSEL:4;
			unsigned char G2ASEL:4;
		} BIT;
	} G2SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char G3BSEL:4;
			unsigned char G3ASEL:4;
		} BIT;
	} G3SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char G4BSEL:4;
			unsigned char G4ASEL:4;
		} BIT;
	} G4SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char G5BSEL:4;
			unsigned char G5ASEL:4;
		} BIT;
	} G5SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char G6BSEL:4;
			unsigned char G6ASEL:4;
		} BIT;
	} G6SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char G7BSEL:4;
			unsigned char G7ASEL:4;
		} BIT;
	} G7SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char G8BSEL:4;
			unsigned char G8ASEL:4;
		} BIT;
	} G8SELR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char G9BSEL:4;
			unsigned char G9ASEL:4;
		} BIT;
	} G9SELR;
} st_poe_t;

typedef struct st_poeg {
	union {
		unsigned long LONG;
		struct {
			unsigned long NFCS:2;
			unsigned long NFEN:1;
			unsigned long INV:1;
			unsigned long :11;
			unsigned long ST:1;
			unsigned long :2;
			unsigned long CDRE5:1;
			unsigned long CDRE4:1;
			unsigned long CDRE3:1;
			unsigned long CDRE2:1;
			unsigned long CDRE1:1;
			unsigned long CDRE0:1;
			unsigned long :1;
			unsigned long OSTPE:1;
			unsigned long IOCE:1;
			unsigned long PIDE:1;
			unsigned long SSF:1;
			unsigned long OSTPF:1;
			unsigned long IOCF:1;
			unsigned long PIDF:1;
		} BIT;
	} POEGGA;
	char           wk0[60];
	union {
		unsigned short WORD;
		struct {
			unsigned short PRKEY:8;
			unsigned short :7;
			unsigned short WP:1;
		} BIT;
	} GTONCWPA;
	char           wk1[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short :7;
			unsigned short NFV:1;
			unsigned short NFS:4;
			unsigned short :3;
			unsigned short NE:1;
		} BIT;
	} GTONCCRA;
	char           wk2[186];
	union {
		unsigned long LONG;
		struct {
			unsigned long NFCS:2;
			unsigned long NFEN:1;
			unsigned long INV:1;
			unsigned long :11;
			unsigned long ST:1;
			unsigned long :2;
			unsigned long CDRE5:1;
			unsigned long CDRE4:1;
			unsigned long CDRE3:1;
			unsigned long CDRE2:1;
			unsigned long CDRE1:1;
			unsigned long CDRE0:1;
			unsigned long :1;
			unsigned long OSTPE:1;
			unsigned long IOCE:1;
			unsigned long PIDE:1;
			unsigned long SSF:1;
			unsigned long OSTPF:1;
			unsigned long IOCF:1;
			unsigned long PIDF:1;
		} BIT;
	} POEGGB;
	char           wk3[60];
	union {
		unsigned short WORD;
		struct {
			unsigned short PRKEY:8;
			unsigned short :7;
			unsigned short WP:1;
		} BIT;
	} GTONCWPB;
	char           wk4[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short :7;
			unsigned short NFV:1;
			unsigned short NFS:4;
			unsigned short :3;
			unsigned short NE:1;
		} BIT;
	} GTONCCRB;
	char           wk5[186];
	union {
		unsigned long LONG;
		struct {
			unsigned long NFCS:2;
			unsigned long NFEN:1;
			unsigned long INV:1;
			unsigned long :11;
			unsigned long ST:1;
			unsigned long :2;
			unsigned long CDRE5:1;
			unsigned long CDRE4:1;
			unsigned long CDRE3:1;
			unsigned long CDRE2:1;
			unsigned long CDRE1:1;
			unsigned long CDRE0:1;
			unsigned long :1;
			unsigned long OSTPE:1;
			unsigned long IOCE:1;
			unsigned long PIDE:1;
			unsigned long SSF:1;
			unsigned long OSTPF:1;
			unsigned long IOCF:1;
			unsigned long PIDF:1;
		} BIT;
	} POEGGC;
	char           wk6[60];
	union {
		unsigned short WORD;
		struct {
			unsigned short PRKEY:8;
			unsigned short :7;
			unsigned short WP:1;
		} BIT;
	} GTONCWPC;
	char           wk7[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short :7;
			unsigned short NFV:1;
			unsigned short NFS:4;
			unsigned short :3;
			unsigned short NE:1;
		} BIT;
	} GTONCCRC;
	char           wk8[186];
	union {
		unsigned long LONG;
		struct {
			unsigned long NFCS:2;
			unsigned long NFEN:1;
			unsigned long INV:1;
			unsigned long :11;
			unsigned long ST:1;
			unsigned long :2;
			unsigned long CDRE5:1;
			unsigned long CDRE4:1;
			unsigned long CDRE3:1;
			unsigned long CDRE2:1;
			unsigned long CDRE1:1;
			unsigned long CDRE0:1;
			unsigned long :1;
			unsigned long OSTPE:1;
			unsigned long IOCE:1;
			unsigned long PIDE:1;
			unsigned long SSF:1;
			unsigned long OSTPF:1;
			unsigned long IOCF:1;
			unsigned long PIDF:1;
		} BIT;
	} POEGGD;
	char           wk9[60];
	union {
		unsigned short WORD;
		struct {
			unsigned short PRKEY:8;
			unsigned short :7;
			unsigned short WP:1;
		} BIT;
	} GTONCWPD;
	char           wk10[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short :7;
			unsigned short NFV:1;
			unsigned short NFS:4;
			unsigned short :3;
			unsigned short NE:1;
		} BIT;
	} GTONCCRD;
} st_poeg_t;

typedef struct st_port0 {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :6;
			unsigned char B1:1;
			unsigned char B0:1;
		} BIT;
	} PDR;
	char           wk0[31];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :6;
			unsigned char B1:1;
			unsigned char B0:1;
		} BIT;
	} PODR;
	char           wk1[31];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :6;
			unsigned char B1:1;
			unsigned char B0:1;
		} BIT;
	} PIDR;
	char           wk2[31];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :6;
			unsigned char B1:1;
			unsigned char B0:1;
		} BIT;
	} PMR;
	char           wk3[31];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :5;
			unsigned char B2:1;
			unsigned char :1;
			unsigned char B0:1;
		} BIT;
	} ODR0;
	char           wk4[63];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :6;
			unsigned char B1:1;
			unsigned char B0:1;
		} BIT;
	} PCR;
	char           wk5[31];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :6;
			unsigned char B1:1;
			unsigned char B0:1;
		} BIT;
	} DSCR;
} st_port0_t;

